fixes charts
